# 1. 리스트 내 리스트 요소 가져오기
# a = [1, 2, 3, ['a', 'b', 'c']]
# print(a[-1]) # ['a', 'b', 'c']
# print(a[3]) # ['a', 'b', 'c']
#
# print(a[-1][0]) # a, a[-1]이 리스트 내 리스트를 선언 후 그 내에 있는 a가 리턴된다.
#
# b = [1, 2, ['a', 'b', ['Life', 'is']]]
# ## Life만 꺼내보기
# print(b[-1][-1][0])
# print(b[2][2][0])

# 2. 리스트 슬라이싱
# a = [1, 2, 3, 4, 5]
# print(a[0:2]) # [1, 2] 리턴, a[0], a[1]

# a = [1, 2, 3, 4, 5]
# print(a[:2]) # [1, 2] 리턴
# print(a[2:]) # [3, 4, 5] 리턴

# 중첩된 리스트에서 슬라이싱 하기
# a = [1, 2, 3, ['a', 'b', 'c'], 4, 5]
# # [a, b]만 꺼내보기
# b = a[:4] # [1, 2, 3, ['a', 'b', 'c']]
# c = b[-1][:2] # b[3][:2]
# print(c)

# 리스트 더하기
# a = [1, 2, 3]
# b = [4, 5, 6]
# print(a + b)

# 리스트 곱하기
# a = [1, 2, 3]
# print(a * 3) # [1, 2, 3, 1, 2, 3, 1, 2, 3]

# 리스트 길이
# a = [1, 2, 3]
# print(len(a))

# 정수 / 실수를 문자열로 바꾸기, str
# a = [1, 2, 3]
# b = "hi"
# # print(a[0] + b), 숫자와 문자열은 더해질 수 없다
# print(str(a[2]) + b)

# 리스트 값 수정, 인덱싱요소 초기화
# a = [1, 2, 3]
# a[0] = 4
# print(a) # [4, 2, 3] 출력된다

# 리스트 요소 삭제, del
# a = [1, 2, 3]
# del a[1] # del a[n] -> n번째 요소를 삭제한다
# print(a)

# a = [1, 2, 3, 4, 5]
# del a[1:]
# print(a)

# # 리스트 요소 추가하기, append
# a = [1, 2, 3]
# a.append(2)
# print(a) # [1, 2, 3, 2]
#
# # 리스트에는 어떤 요소도 추가할 수 있다.
# a.append(['a', 'b'])
# print(a)

# insert(a, b) -> a번째 '위치'에 b '요소'를 추가
# a = [1, 2, 3, 4]
# a.insert(1, 5)
# print(a)


# 리스트 정렬, sort
# a = ['a', 'c', 'b']
# a.sort()
# print(a)

# 리스트 뒤집기, reverse
# a = ['a', 'c', 'd', 'e']
# a.reverse()
# print(a)

# 인덱스 반환, index
# a = [1, 2, 'j', 8]
# print(a.index(2)) # 2의 인덱스 번호에 대해서 리턴
# # 만약 [j]를 리턴하고 싶다면?
# print(a[2])

# 리스트 요소 제거, remove(x)
# a = [1, 2, 3, 3, 4, 5, 8]
# a.remove(3) # 3이 첫번째로 나오는 것만 삭제. 3이 '전체'가 삭제되진 않음
# print(a)

# 리스트 요소 꺼내기, pop
# a = [1, 'j', 3, 87, 'KKK']
# a.pop() # 마지막 인덱스 'kkk' 삭제
# print(a.pop()) # 마지막 인덱스에 있는 값 출력
# print(a) # 87 pop 되고, [1, 'j', 3]

# 리스트 개수 세기, count(x)
# a = [1, 5, 5, 3, 'kj', '81']
# print(a.count('kj'))

# 리스트 확장, extend(x)
a = [1, 2, 3]
a.extend([5, 6]) # a += [5, 6]과 동일하다
print(a)



